#ifndef CALIBRATIONSAMPLE_1B0528E1
#define CALIBRATIONSAMPLE_1B0528E1

#ifdef CALIBRATIONSAMPLE_EXPORTS 
	#define CALIBRATIONSAMPLE_API _declspec(dllexport) __cdecl
#else
	#define CALIBRATIONSAMPLE_API _declspec(dllimport) __cdecl
#endif

//	указатель на функцию, которую будет использовать библиотека для задания значений
typedef void (*DeviceFun)(int r);

//-------------------------------------------------------------------------------
//	номера ошибок при работе с функциями										|
//-------------------------------------------------------------------------------
const int CALIBSAMPLE_NOERROR		= 0;			//	нет ошибки
const int CALIBSAMPLE_ERRINIT		= 1;			//	ошибка инициализации библиотеки
const int CALIBSAMPLE_ERRDATA		= 2;			//	ошибка в калибровочных данных
const int CALIBSAMPLE_ERRSTATE		= 3;			//	несоответствие состояния устройства и вызова функции
const int CALIBSAMPLE_WRONGDEVICE	= 4;			//	обращение к отсутствующему устройству

//---------------------------------------------------------------------------
//	регистрация фукнции для отправки значения резистора на устройство		|
//..........................................................................|
//	id		:	идентификатор устройства									|
//	name	:	строковой идентификатор устройства							|
//	pFun	:	указатель на функцию для задания значений на устройство		|
//---------------------------------------------------------------------------
extern "C" int CALIBRATIONSAMPLE_API RegisterDeviceFunction(int id, const wchar_t * name, DeviceFun pFun);

//---------------------------------------------------------------------------
//	очистка всех регистрационных данных	об устройствах						|
//---------------------------------------------------------------------------
extern "C" void CALIBRATIONSAMPLE_API ClearRegistrations();

//---------------------------------------------------------------------------
//	функция для очистки калибровочных данных устройства						|
//..........................................................................|
//	id	:	идентификатор устройства										|
//---------------------------------------------------------------------------
extern "C" int CALIBRATIONSAMPLE_API ClearCalibrationData(int id);

//---------------------------------------------------------------------------
//	функция для добавки калибровочных данных								|
//..........................................................................|
//	id	:	идентификатор устройства										|
//	r	:	значение резистора												|
//	v	:	значение на устройстве											|
//---------------------------------------------------------------------------
extern "C" int CALIBRATIONSAMPLE_API AddCalibrationData(int id, int r, float v);

//---------------------------------------------------------------------------
//	команда на калибровку устройства										|
//..........................................................................|
//	id			:	идентификатор устройства								|
//	[retval]	:	возвращается номер ошибки								|
//---------------------------------------------------------------------------
extern "C" int CALIBRATIONSAMPLE_API CalibrateDevice(int id);

//---------------------------------------------------------------------------
//	функция для задания значения на панели прибора в откалиброванном состоянии
//---------------------------------------------------------------------------
//	id			:	идентификатор устройства								|
//  v			:	требуемое значение										|
//	[retval]	:	возвращается номер ошибки								|
//---------------------------------------------------------------------------
extern "C" int CALIBRATIONSAMPLE_API ShowDeviceValue(int id, float v);

//---------------------------------------------------------------------------
//	функция для задания значения резистора в неоткалиброванном устройстве	|
//---------------------------------------------------------------------------
//	id			:	идентификатор устройства								|
//  r			:	требуемое значение										|
//	[retval]	:	возвращается номер ошибки								|
//---------------------------------------------------------------------------
extern "C" int CALIBRATIONSAMPLE_API ShowDeviceResistor(int id, int r);

#endif // CALIBRATIONSAMPLE_1B0528E1